Revit 2025 API
CircuitLoadCalculationMethod Enumeration
 Methods to calculate circuit loads
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum CircuitLoadCalculationMethod
Public Enumeration CircuitLoadCalculationMethod
public enum class CircuitLoadCalculationMethod
type CircuitLoadCalculationMethod
Members
Member name | Value | Description
SumTrueLoadAndReactiveLoad | 0 |  Sum true power and reactive power.
SumApparentLoad | 1 |  Sum apparent power.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace